{"name":"file.json","topic":"uCModules","sections":[{"section":"Overview","entries":[{"entry":"Overview","data":["<p>uCModules is an Arduino library for accomplishing common tasks on microcontrollers.  It aims to be portable across microcontroller compilers and has been tested on the 328p and Teensy 3.1.</p>"]},{"entry":"Contents","data":["<ul><li>A flag class that can message between nested class objects.</li><li>Periodic timers that won't drift apart, for scheduling code. (16 and 32 bit)</li><li>A circular buffer template.</li><li>A simple count/threshold-hit counter.</li><li>A system for dealing with real components like knobs, switches, and LEDs.<ul><li>Supplies container for panel components</li><li>Abstracted component logic.</li><li>Abstracted hardware layer.</li><li>Extendable from the user project space.</li></ul></li></ul>"]}]},{"section":"Files","entries":[{"entry":"SomeFile","data":["line1"]}]},{"section":"Examples","entries":[{"entry":"Panel Components","data":["<ul><li><strong>ButtonBlinker</strong> - Demonstration of 1 button and 1 led, with state machine.</li><li><strong>Knob</strong> - Demonstration of 1 Windowed10BitKnob with default settings.</li><li><strong>SixKnobs</strong> - Knobs on A0 through A5. A1 and A2 control window size and samples averaged.</li><li><strong>PanelTemplate</strong> - Does nothing, starting place for projects.</li></ul>"]},{"entry":"Utilities","data":["<ul><li><strong>flagMessagingNested</strong> - Shows how to use the flagMessaging to communicate between classes.  Grounding pin 7 flags an inner class with a MessagingFlag object, which then changes state and communicates back to the outer class through another MessagingFlag object.</li><li><strong>timerModule32Example</strong> - Example XORing 3 timers on the LED pin using uS counts with 32 bit counters</li><li><strong>timerModule32Template</strong> - Same as example sketch with only a single timer, debugTimer, at 1 second</li><li><strong>timerModuleExample</strong> - Example XORing 3 timers on the LED pin using mS counts with 16 bit counters</li><li><strong>timerModuleTemplate</strong> - Same as example sketch with only a single timer, debugTimer, at 1 second</li></ul></li></ul>"]}]},{"section":"API","entries":[{"entry":"Constructor","data":["How to construct"]},{"entry":"someFunction","data":["How to use function."]}]},{"section":"Mine","entries":[{"data":["<img src=\"https://angular.io/assets/images/logos/angular/logo-nav@2x.png\">","",""],"entry":"Not yours"}]}]}